In [2]:
import pandas as pd

In [14]:
chicago = pd.read_csv('chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [4]:
#Memory usage around 1Mb
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1002.1+ KB

In [5]:
#Lets check which column can be converted to category type
chicago.nunique()

Name                      31776
Position Title             1093
Department                   35
Employee Annual Salary     1156
dtype: int64

In [6]:
#Converting Department to category
chicago['Department'] = chicago['Department'].astype('category')

In [7]:
#Reduction around 20%
chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 784.4+ KB

## Common string methods (lower, upper, title and len)

In [9]:
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [10]:
#For every string method you need to put .str. before calling the method
chicago['Name'].str.lower()

0            aaron,  elvia j
1          aaron,  jeffery m
2             aaron,  karina
3        aaron,  kimberlei r
4        abad jr,  vicente m
                ...
32058     zygowicz,  peter j
32059      zymantas,  mark e
32060    zyrkowski,  carlo e
32061    zyskowski,  dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [15]:
chicago['Position Title'] = chicago['Position Title'].str.title()

In [16]:
chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  Water Rate Taker  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    Police Officer       POLICE              $84450.00
2     AARON,  KARINA    Police Officer       POLICE              $84450.00

## Use str method to replace all occurences of character with another

In [13]:
'Hello World'.replace('l','X')

'HeXXo WorXd'

In [17]:
chicago['Department']

0             WATER MGMNT
1                  POLICE
2                  POLICE
3        GENERAL SERVICES
4             WATER MGMNT
               ...
32057    GENERAL SERVICES
32058              POLICE
32059              POLICE
32060              POLICE
32061                DoIT
Name: Department, Length: 32062, dtype: category
Categories (35, object): ['ADMIN HEARNG', 'ANIMAL CONTRL', 'AVIATION', 'BOARD OF ELECTION', ..., 'STREETS & SAN', 'TRANSPORTN', 'TREASURER', 'WATER MGMNT']

In [18]:
chicago['Department'].str.replace('MGMNT','MANAGMENT')

0         WATER MANAGMENT
1                  POLICE
2                  POLICE
3        GENERAL SERVICES
4         WATER MANAGMENT
               ...
32057    GENERAL SERVICES
32058              POLICE
32059              POLICE
32060              POLICE
32061                DoIT
Name: Department, Length: 32062, dtype: object

In [19]:
chicago['Department'] = chicago['Department'].str.replace('MGMNT','MANAGMENT')

In [21]:
chicago['Employee Annual Salary'] = chicago['Employee Annual Salary'].str.replace('$',"").astype(float)
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,WATER MANAGMENT,90744.0
1,"AARON, JEFFERY M",Police Officer,POLICE,84450.0
2,"AARON, KARINA",Police Officer,POLICE,84450.0

## Filter with string methods

In [23]:
#Because we are going to filter we need to make sure everything looks the same, so we normalize data with tolower
mask = chicago['Position Title'].str.lower().str.contains('water')
mask

0         True
1        False
2        False
3        False
4        False
         ...
32057    False
32058    False
32059    False
32060    False
32061    False
Name: Position Title, Length: 32062, dtype: bool

In [24]:
chicago[mask]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,WATER MANAGMENT,90744.0
554,"ALUISE, VINCENT G",Foreman Of Water Pipe Construction,WATER MANAGMENT,102440.0
671,"ANDER, PERRY A",Water Chemist Ii,WATER MANAGMENT,82044.0
685,"ANDERSON, ANDREW J",District Superintendent Of Water Distribution,WATER MANAGMENT,109272.0
702,"ANDERSON, DONALD",Foreman Of Water Pipe Construction,WATER MANAGMENT,102440.0
...,...,...,...,...
29669,"VERMA, ANUPAM",Managing Engineer - Water Management,WATER MANAGMENT,111192.0
30239,"WASHINGTON, JOSEPH",Water Chemist Iii,WATER MANAGMENT,89676.0
30544,"WEST, THOMAS R",Gen Supt Of Water Management,WATER MANAGMENT,115704.0
30991,"WILLIAMS, MATTHEW",Foreman Of Water Pipe Construction,WATER MANAGMENT,102440.0
31405,"WOODRIDGE, ROBERT L",Foreman Of Water Pipe Construction,WATER MANAGMENT,102440.0

In [25]:
mask2 = chicago['Position Title'].str.lower().str.startswith('water')
chicago[mask2]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,WATER MANAGMENT,90744.0
671,"ANDER, PERRY A",Water Chemist Ii,WATER MANAGMENT,82044.0
1054,"ASHLEY, KARMA T",Water Chemist Ii,WATER MANAGMENT,82044.0
1079,"ATKINS, JOANNA M",Water Chemist Ii,WATER MANAGMENT,82044.0
1181,"AZEEM, MOHAMMED A",Water Chemist Ii,WATER MANAGMENT,53172.0
...,...,...,...,...
28574,"THREATT, DENISE R",Water Quality Inspector,WATER MANAGMENT,62004.0
28602,"TIGNOR, DARRYL B",Water Rate Taker,WATER MANAGMENT,78948.0
28955,"TRAVIS COOK, LESLIE R",Water Rate Taker,WATER MANAGMENT,78948.0
29584,"VELAZQUEZ, JOHN",Water Rate Taker,WATER MANAGMENT,78948.0
30239,"WASHINGTON, JOSEPH",Water Chemist Iii,WATER MANAGMENT,89676.0

In [27]:
mask3 = chicago['Position Title'].str.lower().str.endswith('ist')
chicago[mask3]

,Name,Position Title,Department,Employee Annual Salary
184,"AFROZ, NAYYAR",Psychiatrist,HEALTH,99840.0
308,"ALARCON, LUIS J",Loan Processing Specialist,COMMUNITY DEVELOPMENT,81948.0
422,"ALLAIN, CAROLYN",Senior Telecommunications Specialist,DoIT,89880.0
472,"ALLEN, ROBERT",Machinist,WATER MANAGMENT,94328.0
705,"ANDERSON, EDWARD M",Sr Procurement Specialist,PROCUREMENT,91476.0
...,...,...,...,...
31667,"YODER, TERESA G",Archival Specialist,PUBLIC LIBRARY,74304.0
31688,"YOUNGBLOOM, LAURENCE G",Crimes Surveillance Specialist,OEMC,19676.8
31717,"YOUNG, KIMBERLY M",Sr Procurement Specialist,PROCUREMENT,68556.0
31837,"ZAPATA, HUGO",Sr Procurement Specialist,PROCUREMENT,87324.0
31918,"ZEMKE, RICHARD P",Machinist,AVIATION,94328.0

## More dataframe strings strip, lstrip and rstrip

In [28]:
chicago = pd.read_csv('chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [29]:
'       Hello World'.lstrip()

'Hello World'

In [30]:
'Hello World        '.rstrip()

'Hello World'

In [31]:
' Hello World '.strip()

'Hello World'

In [32]:
chicago['Name'] = chicago['Name'].str.strip()
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

## String methods on index and columns

In [33]:
chicago2 = pd.read_csv('chicago.csv',index_col='Name').dropna(how='all')
chicago2['Department'] = chicago['Department'].astype('category')
chicago2.tail()

,Position Title,Department,Employee Annual Salary
Name,,,
"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,NaN,$99528.00
"ZYGOWICZ, PETER J",POLICE OFFICER,NaN,$87384.00
"ZYMANTAS, MARK E",POLICE OFFICER,NaN,$84450.00
"ZYRKOWSKI, CARLO E",POLICE OFFICER,NaN,$87384.00
"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,NaN,$113664.00

In [34]:
chicago2.index

Index(['AARON,  ELVIA J', 'AARON,  JEFFERY M', 'AARON,  KARINA',
       'AARON,  KIMBERLEI R', 'ABAD JR,  VICENTE M', 'ABARCA,  ANABEL',
       'ABARCA,  EMMANUEL', 'ABASCAL,  REECE E', 'ABBASI,  CHRISTOPHER',
       'ABBATACOLA,  ROBERT J',
       ...
       'ZWIT,  JEFFREY J', 'ZWOLFER,  MATTHEW W', 'ZYCH,  MATEUSZ',
       'ZYDEK,  BRYAN', 'ZYGADLO,  JOHN P', 'ZYGADLO,  MICHAEL J',
       'ZYGOWICZ,  PETER J', 'ZYMANTAS,  MARK E', 'ZYRKOWSKI,  CARLO E',
       'ZYSKOWSKI,  DARIUSZ'],
      dtype='object', name='Name', length=32062)

In [35]:
chicago2.index = chicago2.index.str.strip().str.title()
chicago2.tail()

,Position Title,Department,Employee Annual Salary
Name,,,
"Zygadlo, Michael J",FRM OF MACHINISTS - AUTOMOTIVE,NaN,$99528.00
"Zygowicz, Peter J",POLICE OFFICER,NaN,$87384.00
"Zymantas, Mark E",POLICE OFFICER,NaN,$84450.00
"Zyrkowski, Carlo E",POLICE OFFICER,NaN,$87384.00
"Zyskowski, Dariusz",CHIEF DATA BASE ANALYST,NaN,$113664.00

In [36]:
chicago2.columns

Index(['Name', 'Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [38]:
chicago2.columns = chicago2.columns.str.upper()
chicago2.head()

,POSITION TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,NaN,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,NaN,$84450.00
"Aaron, Karina",POLICE OFFICER,NaN,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,NaN,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,NaN,$106836.00

## Split string by characters using .split() method

In [41]:
chicago = pd.read_csv('chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [43]:
'Hello my name is Luciano'.split(" ")

['Hello', 'my', 'name', 'is', 'Luciano']

In [44]:
'HelloXmyXnameXisXLuciano'.split("X")

['Hello', 'my', 'name', 'is', 'Luciano']

In [45]:
chicago['Position Title']

0                      WATER RATE TAKER
1                        POLICE OFFICER
2                        POLICE OFFICER
3              CHIEF CONTRACT EXPEDITER
4                     CIVIL ENGINEER IV
                      ...
32057    FRM OF MACHINISTS - AUTOMOTIVE
32058                    POLICE OFFICER
32059                    POLICE OFFICER
32060                    POLICE OFFICER
32061           CHIEF DATA BASE ANALYST
Name: Position Title, Length: 32062, dtype: object

In [47]:
chicago['Position Title'].str.split(" ")

0                        [WATER, RATE, TAKER]
1                           [POLICE, OFFICER]
2                           [POLICE, OFFICER]
3                [CHIEF, CONTRACT, EXPEDITER]
4                       [CIVIL, ENGINEER, IV]
                         ...
32057    [FRM, OF, MACHINISTS, -, AUTOMOTIVE]
32058                       [POLICE, OFFICER]
32059                       [POLICE, OFFICER]
32060                       [POLICE, OFFICER]
32061            [CHIEF, DATA, BASE, ANALYST]
Name: Position Title, Length: 32062, dtype: object

In [50]:
chicago['Position Title'].str.split(" ").str.get(1)

0            RATE
1         OFFICER
2         OFFICER
3        CONTRACT
4        ENGINEER
           ...
32057          OF
32058     OFFICER
32059     OFFICER
32060     OFFICER
32061        DATA
Name: Position Title, Length: 32062, dtype: object

In [51]:
chicago['Name']

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32057    ZYGADLO,  MICHAEL J
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
Name: Name, Length: 32062, dtype: object

In [67]:
chicago['Name'].str.split(",").str.get(1).str.strip().str.split(" ").str.get(0)

0            ELVIA
1          JEFFERY
2           KARINA
3        KIMBERLEI
4          VICENTE
           ...
32057      MICHAEL
32058        PETER
32059         MARK
32060        CARLO
32061      DARIUSZ
Name: Name, Length: 32062, dtype: object

In [68]:
chicago['Position Title']

0                      WATER RATE TAKER
1                        POLICE OFFICER
2                        POLICE OFFICER
3              CHIEF CONTRACT EXPEDITER
4                     CIVIL ENGINEER IV
                      ...
32057    FRM OF MACHINISTS - AUTOMOTIVE
32058                    POLICE OFFICER
32059                    POLICE OFFICER
32060                    POLICE OFFICER
32061           CHIEF DATA BASE ANALYST
Name: Position Title, Length: 32062, dtype: object

In [69]:
chicago['Position Title'].str.split(" ", expand = True)

,0,1,2,3,4,5,6,7,8
0,WATER,RATE,TAKER,None,None,None,None,None,None
1,POLICE,OFFICER,None,None,None,None,None,None,None
2,POLICE,OFFICER,None,None,None,None,None,None,None
3,CHIEF,CONTRACT,EXPEDITER,None,None,None,None,None,None
4,CIVIL,ENGINEER,IV,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...
32057,FRM,OF,MACHINISTS,-,AUTOMOTIVE,None,None,None,None
32058,POLICE,OFFICER,None,None,None,None,None,None,None
32059,POLICE,OFFICER,None,None,None,None,None,None,None
32060,POLICE,OFFICER,None,None,None,None,None,None,None
32061,CHIEF,DATA,BASE,ANALYST,None,None,None,None,None

In [71]:
chicago['Position Title'].str.split(" ", expand = True, n = 1) #n = 1 max number of splits

            0                           1
0       WATER                  RATE TAKER
1      POLICE                     OFFICER
2      POLICE                     OFFICER
3       CHIEF          CONTRACT EXPEDITER
4       CIVIL                 ENGINEER IV
...       ...                         ...
32057     FRM  OF MACHINISTS - AUTOMOTIVE
32058  POLICE                     OFFICER
32059  POLICE                     OFFICER
32060  POLICE                     OFFICER
32061   CHIEF           DATA BASE ANALYST

[32062 rows x 2 columns]

In [73]:
chicago[['First title words','Second title words']] = chicago['Position Title'].str.split(" ", expand = True, n = 1) #n = 1 max number of splits

In [74]:
chicago.head(3)

,Name,Position Title,Department,Employee Annual Salary,First title words,Second title words
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,WATER,RATE TAKER
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,POLICE,OFFICER
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,POLICE,OFFICER